{
    "lang" : "Language",
    "blog" : "Blog",
    "download" : "Download",
    "about" : "About",
    
    "downloadButton" : "Download for Windows",
    "downloadTittle" : "Download Quarrel of Civilizations",
    "downloadMac" : "Download for Mac",

    "footer1" : "Power By:",

    "PTIT": "Proyect description",
    "PDES": "Empire2D is a project developed in Unity with the aim of creating a real-time strategy (RTS) game with gameplay dynamics based on the famous Age of Empires, but in a captivating 2D format and featuring faster-paced matches.",
    "PDES2": "The game encompasses classic features such as movement, resource gathering, and construction, as well as a technology research system to enhance your empire. It also includes strategies and formations assigned to units for more strategic and engaging combat.",
    "PAB": "Developer",
    "PA": "2ºCFGS DAM student",
    "GITHUB": "My github",
    "mission": "V11 games is a project to create amazing worlds in unity",

    "section1-title": "Introduction",
    "section1": "The idea of the project was to delve deeper and gain a better understanding of how a graphics engine like Unity works. To achieve this, I decided to convert the famous Age of Empires into a 2D format with faster-paced matches, averaging about 15 minutes in duration. In this adaptation, I aimed to capture the essence of the original game, offering strategic depth and captivating gameplay within a condensed timeframe. Players will experience the thrill of building their civilizations, gathering resources, and commanding armies, all while engaging in intense battles and forging strategic alliances. By condensing the gameplay, we create an immersive experience that allows for quick decision-making and agile progression, turning each match into an exciting and dynamic experience.",
    "section2-title": "Technologies",
    "section2": "For the develop of this proyect, the technologies that have been used was:",
    "section2-2": "The utilization of these tools is mainly due to the fact that they are the ones I have learned during my training and I find them to be the best and most convenient for carrying out the purpose of the project. For the website you are currently reading this on, Angular has been used as the framework, supported by NodeJS for package management and installation. Bootstrap has been employed for page styling, and Firebase for cloud deployment.",
    "section2-3": "On the other hand, for the development of the video game, Unity has been employed as the graphics engine, and Photoshop has been used for sprite creation. It is worth mentioning that all the sounds are sourced from the Unity Asset Store, along with some animations. The music used is the original soundtrack from Age of Empires.",
    "section3-title": "Web page develop",
    "section3": "Working with tools that I have had significant prior experience with, the creation of the website has not been a major challenge. Perhaps the implementation of Angular animations, such as navbar tracking or the appearance of certain elements, posed some difficulty. Additionally, the file download system was implemented using an internal Angular library that functions as a pipe. Apart from these aspects, the usual libraries have been utilized, such as ngx-translate for translations, Firebase for backend support, and Angular Material for theme customization.",
    "section3-2": "In summary, the technologies used have been key in creating a modern, scalable website with a smooth user experience and development process.",
    "section4-title": "Unity develop",
    "section4": "The development in the game engine has been quite chaotic. Not only because it was a new tool, but also due to the multitude of considerations involved in game development. Handling physics within the engine can be incredibly complex. Tasks such as defining collision rules between objects or mapping navigation can turn into a disaster if not properly managed. Additionally, selecting a project structure design and learning it has also taken a considerable amount of time.",
    "sectin4-2": "Despite all the challenges, learning a tool like Unity has been highly enriching for professional development.",
    "section5-title": "Photoshop develop",
    "section5": "Regarding Photoshop, as a tool I have been using for a couple of years, it hasn't posed a significant difficulty. Perhaps the main challenge lies in considering the project's dimensions when creating sprites and determining the number required for smooth animations. Apart from that, the time it takes to develop each sprite, no matter how simple, can be a factor to consider.",
    "section6-title": "Cloud deployment",
    "section6": "For the cloud deployment of the website, Firebase hosting has been used, which has allowed for easy and quick deployment at no cost. Initially, attempts were made with Amazon Web Services (AWS), but due to the numerous issues encountered with the virtual machine, the decision was made to switch to Firebase.",
    "section7-title": "Installer",
    "section7": "To create the downloadable installer through the website, I have used Inno Setup. This software is a powerful .exe installer for Windows, which allows you to create a program installer without the need to learn its underlying scripting language. With its user-friendly wizard, one can easily create an installer for any desired program.",
    "section8-title": "Demo video"
}